# ExportLinetypeKey Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportLinetypeKey Members
ExportLinetypeKey Class Constructors Methods Properties See Also
---
The ExportLinetypeKey type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExportLinetypeKey()()()() | Constructs a new default ExportLinetypeKey. |
| ExportLinetypeKey(String) | Constructs a new default ExportLinetypeKey using the original line type name as input. |
| ExportLinetypeKey(ExportLinetypeKey) | Constructs a new copy of the input ExportLinetypeKey object. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ExportLinetypeKey |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| OriginalLinetypeName | The original linetype name. |

# See Also
ExportLinetypeKey Class
Autodesk.Revit.DB Namespace